//----------------------------------------------------------------------//
// スケーリング処理														//
//																		//
//----------------------------------------------------------------------//
#include "usr_scale.h"

//---------------------------------------------------------------------------
void AssignScaledFont(TFont *dst, TFont *src,
	TControl *cp,		//基準コントロール	(default = NULL)
	TColor fg)			//文字色			(default = clNone)
{
	dst->Assign(src);
	dst->Size = ScaledInt(src->Size, cp);
	if (fg!=Graphics::clNone) dst->Color = fg;
}
//---------------------------------------------------------------------------
